let sum = 0;

let a = prompt(`Скільки буде 2+2?`);
if (a == `4`) {
    sum += 10;
} else {
    alert(`Лузер`);
}

let s = confirm(`Сонце встає на сході?`);
if (s == true) {
    sum += 10;
} else {
    alert(`Лузер`);
}

let d = prompt(`Скільки буде 5 / 0?(Питання з каверзою)`);
if (d == `Поділ на нуль неможливий`) {
    sum += 10;
} else {
    alert(`Лузер`);
}

let f = prompt(`Якого кольору небо?`);
if (f == `Блакитного`) {
    sum += 10;
} else {
    alert(`Лузер`);
}

let g = prompt(`Яка правильна відповідь на головне питання життя, всесвіту та всього такого?`);
if (g == `42`) {
    sum += 10;
} else {
    alert(`Лузер`);
}


alert(`Ну і який у тебе IQ? ${sum}`)